<QucsStudio Schematic 2.5.7>
<Properties>
  <View=0,0,997,800,1,0,0>
  <Grid=10,10,1>
  <DataSet=dcdetect.dat>
  <DataDisplay=dcdetect.dpl>
  <OpenDisplay=1>
  <showFrame=0>
  <FrameText0=Title>
  <FrameText1=Drawn By:>
  <FrameText2=Date:>
  <FrameText3=Revision:>
</Properties>
<Symbol>
</Symbol>
<Components>
  <Vac V1 1 350 400 18 -26 0 0 "1 V" 1 "1 GHz" 0 "0" 0 "0" 0 "SUBCLICK" 0>
  <GND * 1 350 430 0 0 0 0>
  <OpAmp OP1 1 650 330 -18 40 1 0 "1e6" 0 "15 V" 0>
  <GND * 1 620 350 0 0 0 0>
  <GND * 1 480 430 0 0 0 0>
  <R R1 1 410 310 -26 -59 1 0 "nan" 1 "26.85" 0 "0" 0 "0" 0 "26.85" 0 "european" 0 "SMD0603" 0>
  <R R2 1 480 260 15 -26 0 1 "nan" 1 "26.85" 0 "0" 0 "0" 0 "26.85" 0 "european" 0 "SMD0603" 0>
  <R R3 1 540 310 -26 15 0 0 "nan" 1 "26.85" 0 "0" 0 "0" 0 "26.85" 0 "european" 0 "SMD0603" 0>
  <C C1 1 600 260 17 -26 0 1 "2.2µF" 1 "" 0 "neutral" 0 "SMD0603" 0>
  <C C2 1 480 400 17 -26 0 1 "nanF" 1 "" 0 "neutral" 0 "SMD0603" 0>
  <OpAmp OP2 1 840 330 -23 -60 0 0 "1e6" 0 "15 V" 0>
  <GND * 1 750 430 0 0 0 0>
  <R R4 1 720 310 -26 -59 1 0 "nan" 1 "26.85" 0 "0" 0 "0" 0 "26.85" 0 "european" 0 "SMD0603" 0>
  <C C3 1 750 400 17 -26 0 1 "2.2µF" 1 "" 0 "neutral" 0 "SMD0603" 0>
  <R Rload 1 900 400 15 -26 0 1 "1k" 1 "26.85" 0 "0" 0 "0" 0 "26.85" 0 "european" 0 "SMD0603" 0>
  <GND * 1 900 430 0 0 0 0>
  <.AC AC1 1 370 480 0 41 0 0 "log" 1 "1Hz" 1 "100Hz" 1 "501" 1 "no" 0 "none" 0>
</Components>
<Wires>
  <350 310 350 370 "" 0 0 0 "">
  <350 310 380 310 "" 0 0 0 "">
  <900 330 900 370 "output" 930 310 30 "">
  <880 330 900 330 "" 0 0 0 "">
  <440 310 480 310 "" 0 0 0 "">
  <570 310 600 310 "" 0 0 0 "">
  <480 310 510 310 "" 0 0 0 "">
  <480 290 480 310 "" 0 0 0 "">
  <480 310 480 370 "" 0 0 0 "">
  <600 310 620 310 "" 0 0 0 "">
  <600 290 600 310 "" 0 0 0 "">
  <600 230 690 230 "" 0 0 0 "">
  <480 230 600 230 "" 0 0 0 "">
  <690 310 690 330 "" 0 0 0 "">
  <690 230 690 310 "" 0 0 0 "">
  <750 310 810 310 "" 0 0 0 "">
  <750 310 750 370 "" 0 0 0 "">
  <810 350 810 380 "" 0 0 0 "">
  <810 380 880 380 "" 0 0 0 "">
  <880 330 880 380 "" 0 0 0 "">
</Wires>
<Diagrams>
</Diagrams>
<Paintings>
  <Text 560 480 12 #000000 0 "active low-pass filter, 10Hz cutoff \n 3^{th} order Chebyshev ">
</Paintings>
